---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
source: html/f3b7da83-dc35-11ef-0fb0-1c3597eab2ec.htm
---
# StructuralSectionRectangleHSS Methods

Returns size of the section boundary.